Revit 2027 API
ParameterTypeId.ViewPhaseFilter Property
 "Phase Filter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewPhaseFilter { get; }
Public Shared ReadOnly Property ViewPhaseFilter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewPhaseFilter {
	ForgeTypeId^ get ();
}
static member ViewPhaseFilter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace